app/Controllers/Categorias.php

    public function index()
    {
        $categoriaModel = new CategoriaModel();
        echo view('Categoria', [
            'categorias' => $categoriaModel->findAll()
        ]);
---
SELECT *
FROM `categorias`

    public function edit($id)
    {
        $categoriaModel = new CategoriaModel();

        echo view('categoria/edit', [
            'categorias' => $categoriaModel->find($id)
        ]);
---
SELECT *
FROM `categorias`
WHERE `categorias`.`id` = ' 8'

    public function show($id)
    {
        $categoriaModel = new CategoriaModel();

        //  var_dump($categoriaModel->find($id));
        echo view('categoria/show', [
            'categorias' => $categoriaModel->find($id)
        ]);
---
SELECT *
FROM `categorias`
WHERE `categorias`.`id` = ' 8'

    public function create()
    {
        $categoriaModel = new CategoriaModel();

        if ($this->validate('categorias')) {
            $categoriaModel->insert([
                'titulo' => $this->request->getPost('titulo'),
            ]);
---
INSERT INTO `categorias` (`titulo`) VALUES ('crear2')