app/Controllers/Libros.php

    public function index()
    {
        $libroModel = new LibroModel();
       //echo view('Libreria', [
       //     'variable1' => 'Ejemplo1',
       //     'nVariable' => [1,2,3]
       // ]);
       echo view('Libreria', [
            'libros' => $libroModel->findAll()
       ]);
---
SELECT *
FROM `libros`